{
    "Basketball Players": [
        {
            "name": "Damian Lillard",
            "team(s)": "Portland Trailblazers, Milwaukee Bucks",
            "draft year & pick": "2012, Rd 1 Pick 6",
            "accolades": "8x All Star, 7x All-NBA, 2012-2013 All-Rookie, 2012-2013 ROY, NBA 75th Anniv. Team, Olympic Gold Medalist",
            "bio": "Damian Lamonte Ollie Lillard is an American profession basketball player who currently plays PG for the Milwaukee Bucks. He was born on July 15, 1990 in Oakland, CA and attended Oakland HS and then Weber State University. He is well known for his relentless three point shooting ability and his tremendous leadership in clutch moments.",
            "id": "1"
        },
        {
            "name": "Kyrie Irving",
            "team(s)": "Cleveland Cavaliers, Boston Celtics, Brooklyn Nets, Dallas Mavericks",
            "draft year & pick": "2011, Rd 1 Pick 1",
            "accolades": "8x All Star, 3x All-NBA, 2016 NBA Champ, 2011-2012 All-Rookie, 2011-12 ROY, Olympic Gold Medalist",
            "bio": "Kyrie Andrew Irving is an Australian born professional basketball player who currently plays PG/SG for the Dallas Mavericks. He was born on March 23, 1992 in Melbourne, Australia before moving to the US at a young age. He grew up in West Orange, NJ and attended Saint Patrick HS and Duke University. He is widely regarded as one of the best ball-handlers and finishers in the history of the NBA and also has a polished jumpshot that can bail him out. His creativity and mastery is unmatched.",
            "id": "2"
        },
        {
            "name": "Stephen Curry",
            "team(s)": "Golden State Warriors",
            "draft year & pick": "2009, Rd 1 Pick 7",
            "accolades": "10x All Star, 2x Scoring Champ, 4x NBA Champ, 10x All-NBA, 2009-10 All-Rookie, 2015-16 Steals Champ, 2x NBA MVP, 2021-22 WCF MVP, 2021-22 Finals MVP, NBA 75th Anniv. Team, Olympic Gold Medalist ",
            "bio": "Wardell Stephen Curry II is an American professional basketball player who currently plays PG for the Golden State Warriors. He was born on March 14, 1988 in Akron, Ohio and attended Charlotte Christian HS and then Davidson College. He is widely regarded as the greatest three point shooter in the history of the NBA and currently holds the NBA record for most three pointers made. His marksmanship from downtown along with his impeccable ball handling has created a new era of playstyle amongst player positions and has shifted the defense approach for teams regarding the three point shot. In late game situations, he has been known to dominate and close the game out. ",
            "id": "3"
        },
        {
            "name": "Lebron James",
            "team(s)": "Cleveland Cavaliers, Miami Heat, Los Angeles Lakers",
            "draft year & pick": "2003, Rd 1 Pick 1",
            "accolades": "20x NBA All Star, 2007-08 Scoring Champ, 20x All-NBA, 2003-04 ROY, 2003-04 All-Rookie, 4x NBA Champ, 4x NBA MVP, 4x Finals MVP, 6x All-Defensive, 2019-20 AST Champ, NBA 75th Anniv. Team, 4x Olympic Medalist(3G, 1B)",
            "bio": "LeBron Raymone James is an American professional basketball player who currently plays PF for the Los Angeles Lakers. He was born on December 30, 1984 in Akron, Ohio and attended St. Vincent-St. Mary HS. He came into the NBA straight out of high school and from there on out has become one of the most dominant players and well known faces in the league. His ability to be a leader, play outstanding basketball on both sides and guard all five positions is none like any other. He has been able withstand the test of time and has been an impactful player in the NBA in regards to being able to lead his team to victory in clutch moments. He currently holds the record as the leader in points scored in the NBA at 40,000 and counting.",
            "id": "4"
        },
        {
            "name": "Kevin Durant",
            "team(s)": "Seattle SuperSonics, Oklahoma City Thunder, Golden State Warriors, Brooklyn Nets, Phoenix Suns",
            "draft year & pick": "2007, Rd 1 Pick 2",
            "accolades": "14x NBA All-Star, 4x Scoring Champ, 2x NBA Champ, 2x Finals MVP, 11x All-NBA, 2007-08 All-Rookie, 2007-08 ROY, 2013-14 NBA MVP, NBA 75th Anniv. Team, 4x Olympic Gold Medalist",
            "bio": "Kevin Wayne Durant is an American professional basketball player who currently plays PF for the Phoenix Suns. He was born on September 29, 1988 in Washington, D.C and attended National Christian Academy, Oak Hill Academy, Montrose Christian School and then the University of Texas. He is well known as one of the best scorers in the history of the NBA especially from midrange. His tall and slender frame, speed, and creativity mixed with his position has influenced a new playstyle within the PF positon earning him the nickname Slim Reaper. His hard work and passion for the sport has pushed him into greater heights and helped him to accomplish some respectable feats. He is also known for being a reliable closer in close game situations.",
            "id": "5"
        },
        {
            "name": "Derrick Rose",
            "team(s)": "Chicago Bulls, New York Knicks, Cleveland Cavaliers, Minnesota Timberwolves, Detroit Pistons, Memphis Grizzlies",
            "draft year & pick": "2008, Rd 1 Pick 1",
            "accolades": "3x All Star, 2010-11 All-NBA, 2008-09 All-Rookie, 2008-09 ROY, 2010-11 NBA MVP, 2x FIBA Worl Cup Gold Medalist",
            "bio": "Derrick Martell Rose is a former professional basketball player who played PG in the NBA for 15 seasons. He was born on October 4, 1988 in Chicago, Illinois and attended Simeon HS and then Memphis University. He was the youngest player ever to have been an NBA MVP and was well known for his outstanding athleticism, finishing ability including his ferocious dunks, and his unwavering leadership in times that helped his team when it counted the most. Injuries unfortunately plagued his career but he was able to make the most out of it and always left everything on the floor when he stepped on the court. He will always be remembered as one of the most talented and domainant PGs of the 2000-10 decade.",
            "id": "6"
        },
        {
            "name": "Carmelo Anthony",
            "team(s)": "Denver Nuggets, New York Knicks, Oklahoma City Thunder, Houston Rockets, Portland Trailblazers, Los Angeles Lakers",
            "draft year & pick": "2003, Rd 1 Pick 3",
            "accolades": "10x All Star, 2012-13 Scoring Champ, 6x All-NBA, 2003-04 All Rookie, NBA 75th Anniv. Team",
            "bio": "Carmelo Kyam Anthony is a former professional basketball player who played SF/PF in the NBA for 19 years. He was born on May 29, 1984 in Brooklyn, New York and attended Towson Catholic HS and then Syracuse University. He was well known as one of the best scorers in the NBA and having one of the best post work games as well. His jumpshot was electric and he was a strong leader for his team in times when it counted the most. His playstyle and spontaneous hot streaks have been attributes that have helped him in pushing his teams through to win games.",
            "id": "7"
        },
        {
            "name": "Giannis Antetokounmpo",
            "team(s)": "Milwaukee Bucks",
            "draft year & pick": "2013, Rd 1 Pick 15",
            "accolades": "8x NBA All Star, 8x All-NBA, 2013-14 All-Rookie, 2021 NBA Champ, 5x All-Defensive, 2016-17 MIP, 2x NBA MVP, 2020-21 Finals MVP, 2019-20 Def POY, NBA 75th Anniv. Team",
            "bio": "Giannis Antetokounmpo is a Greek-Nigerian professional basketball player who currently plays PF for the Milwaukee Bucks. He was born on December 6, 1994 in Athens, Greece to Nigerian parents and grew up playing basketball around the age of 17. He has settled in as one of the formidable players in the NBA with his unique set of athleticism and long frame earning him the nickname Greek Freak. His archetype and resilience has helped him dominate the game on both sides and lead his team into victorious situations while reshaping the way a player with his size, speed and strength can takeover in the sport of basketball.",
            "id": "8"
        },
        {
            "name": "Dwyane Wade",
            "team(s)": "Miami Heat, Chicago Bulls, Cleveland Cavaliers",
            "draft year & pick": "2003, Rd 1 Pick 5",
            "accolades": "13x All Star, 2003-04 All-Rookie, 2008-09 Scoring Champ, 3x NBA Champ, 8x All-NBA, 3x All Defensive, 2005-06 Finals MVP, NBA 75th Anniv. Team, Hall of Fame, 2x Olympic Medalist(1G,1B)",
            "bio": "Dwyane Tyrone Wade Jr. is a former professional basketball player who played SG in the NBA for 16 years. He was born on January 17, 1982 in Chicago, Illinois and attended Richards HS and then Marquette University. He was well known as one of the best SGs of the NBA and his electrifying athleticism was a contributing factor as well. He was dominant scorer, work horse and tenacious defender who never gave up on plays and always intimidated his opponents. His playstyle, leadership and unrelenting work has redefined the SG position and changed the way the game of basketball is played.",
            "id": "9"
        },
        {
            "name": "Nikola Jokić",
            "team(s)": "Denver Nuggets",
            "draft year & pick": "2014, Rd 2 Pick 11",
            "accolades": "6x All Star, 6x All-NBA, 3x NBA MVP, 2023 NBA Champ, 2022-23 Finals MVP, 2015-16 All-Rookie, 2022-23 WCF MVP",
            "bio": "Nikola Jokić is a Serbian professional basketball player who currently plays C for the Denver Nuggets. He was born on February 19, 1995 in Sombor, Serbia and started playing basketball around the age of 17. He is well known for being one of the most exciting and dominant faces in the NBA due to his remarkable ability to effectively score in the paint, being able to stretch the floor with his shooting and also being an excellent playmaker with his impeccable passing. His unique playstyle and leadership has solidifid him as one of the most prolific centers in the NBA and has redefined the center position because of it.",
            "id": "10"
        }
    ]
}